dicstart = {
"000100" : 1, #초성 ㄱ
"100100" : 3, #초성 ㄴ
"010100" : 4, #초성 ㄷ
"000010" : 6, #초성 ㄹ
"100010" : 7, #초성 ㅁ
"000110" : 8, #초성 ㅂ
"000001" : 10, #초성 ㅅ
"110110" : 12, #초성 ㅇ
"000101" : 13, #초성 ㅈ
"000011" : 15, #초성 ㅊ
"110100" : 16, #초성 ㅋ
"110010" : 17, #초성 ㅌ
"100110" : 18, #초성 ㅍ
"010110" : 19 #초성 ㅎ
}

dicmid = {
"110001" : 1, #모음 ㅏ
"001110" : 3, #모음 ㅑ
"011100" : 5, #모음 ㅓ
"100011" : 7, #모음 ㅕ
"101001" : 9, #모음 ㅗ
"001101" : 13, #모음 ㅛ
"101100" : 14, #모음 ㅜ
"100101" : 18, #모음 ㅠ
"010101" : 19, #모음 ㅡ
"101010" : 21, #모음 ㅣ
"111010" : 2, #모음 ㅐ
"101110" : 6, #모음 ㅔ
"001100" : 8, #모음 ㅖ
"111001" : 10, #모음 ㅘ
"101111" : 12, #모음 ㅚ
"111100" : 15, #모음 ㅝ
"010111" : 20 #모음 ㅢ
}

dicend = {
"100000" : 2, #종성 ㄱ
"010010" : 5, #종성 ㄴ
"001010" : 8, #종성 ㄷ
"010000" : 9, #종성 ㄹ
"010001" : 17, #종성 ㅁ
"110000" : 18, #종성 ㅂ
"001000" : 20, #종성 ㅅ
"011011" : 22, #종성 ㅇ
"101000" : 23, #종성 ㅈ
"011000" : 24, #종성 ㅊ
"011010" : 25, #종성 ㅋ
"011001" : 26, #종성 ㅌ
"010011" : 27, #종성 ㅍ
"001011" : 28  #종성 ㅎ

}

def match(bit):
    num=dicstart.get(bit)
    if num != None:
        # 초성에 있는 경우, 입력되는 열 번호는 나중에 처리
        return 0, num
    else:
        num=dicmid.get(bit)
        if num != None:
            #중성에 있는 경우
            return 1, num
        else:
            num=dicend.get(bit)
            if num !=None:
                #종성에 있는 경우
                return 2, num
            else:
                #약어 경우 추가해야함 여기도 없을 때 return 값?일단 7넣음
                return 7

#nmode=1 -> number mode / 
nmode=0

value = input()

print(match(value)) 

# if nmode==0: 
#     if value == "001111":
#         nmode=1
#     else:
#         matval=match(value)
#         #matval 받은 것을 2차원 배열에 입력하는 함수 만들어야함
# else:
#     matval=dicnum.get(value)
#     #숫자에서 찾음
#     if matval != None:
#         # 찾은 숫자열 2차원배열에 넣기
#     else:
#         nmode=0
#         matval=match(value)
#         #2차원 배열에 집어넣기


